Revit 2024 API
ProjectInfo.Name Property
Get or Set the Project Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Name { get; set; }
Visual Basic
Public Property Name As String
	Get
	Set
Visual C++
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
Remarks
This property is used to get or set the Project Name of the Project Information.
See Also
ProjectInfo Class
Autodesk.Revit.DB Namespace